import Paper from '@/components/Paper';

export default function Test() {
  return (
    <Paper title='행렬'>
      국가는 지역간의 균형있는 발전을 위하여 지역경제를 육성할 의무를 진다. 각급
      선거관리위원회의 조직·직무범위 기타 필요한 사항은 법률로 정한다.
      국회의원의 수는 법률로 정하되, 200인 이상으로 한다. 국무총리는 국회의
      동의를 얻어 대통령이 임명한다. 모든 국민은 법률이 정하는 바에 의하여
      국가기관에 문서로 청원할 권리를 가진다. 정당은 법률이 정하는 바에 의하여
      국가의 보호를 받으며, 국가는 법률이 정하는 바에 의하여 정당운영에 필요한
      자금을 보조할 수 있다. 모든 국민은 자기의 행위가 아닌 친족의 행위로 인하여
      불이익한 처우를 받지 아니한다. 정당은 그 목적·조직과 활동이 민주적이어야
      하며, 국민의 정치적 의사형성에 참여하는데 필요한 조직을 가져야 한다.
      정기회의 회기는 100일을, 임시회의 회기는 30일을 초과할 수 없다. 국회의원이
      회기전에 체포 또는 구금된 때에는 현행범인이 아닌 한 국회의 요구가 있으면
      회기중 석방된다. 국무총리·국무위원 또는 정부위원은 국회나 그 위원회에
      출석하여 국정처리상황을 보고하거나 의견을 진술하고 질문에 응답할 수 있다.
      선거와 국민투표의 공정한 관리 및 정당에 관한 사무를 처리하기 위하여
      선거관리위원회를 둔다. 감사원의 조직·직무범위·감사위원의
      자격·감사대상공무원의 범위 기타 필요한 사항은 법률로 정한다. 정당의
      목적이나 활동이 민주적 기본질서에 위배될 때에는 정부는 헌법재판소에 그
      해산을 제소할 수 있고, 정당은 헌법재판소의 심판에 의하여 해산된다. 모든
      국민은 법 앞에 평등하다. 누구든지 성별·종교 또는 사회적 신분에 의하여
      정치적·경제적·사회적·문화적 생활의 모든 영역에 있어서 차별을 받지
      아니한다. 누구든지 체포 또는 구속의 이유와 변호인의 조력을 받을 권리가
      있음을 고지받지 아니하고는 체포 또는 구속을 당하지 아니한다. 체포 또는
      구속을 당한 자의 가족등 법률이 정하는 자에게는 그 이유와 일시·장소가
      지체없이 통지되어야 한다. 제2항과 제3항의 처분에 대하여는 법원에 제소할 수
      없다. 국가는 노인과 청소년의 복지향상을 위한 정책을 실시할 의무를 진다.
      국회는 법률에 저촉되지 아니하는 범위안에서 의사와 내부규율에 관한 규칙을
      제정할 수 있다. 피고인의 자백이 고문·폭행·협박·구속의 부당한 장기화 또는
      기망 기타의 방법에 의하여 자의로 진술된 것이 아니라고 인정될 때 또는
      정식재판에 있어서 피고인의 자백이 그에게 불리한 유일한 증거일 때에는 이를
      유죄의 증거로 삼거나 이를 이유로 처벌할 수 없다. 대통령이 궐위되거나
      사고로 인하여 직무를 수행할 수 없을 때에는 국무총리, 법률이 정한
      국무위원의 순서로 그 권한을 대행한다. 누구든지 체포 또는 구속을 당한
      때에는 적부의 심사를 법원에 청구할 권리를 가진다. 위원은 탄핵 또는 금고
      이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다. 연소자의 근로는
      특별한 보호를 받는다. 대한민국의 영토는 한반도와 그 부속도서로 한다.
      헌법재판소는 법관의 자격을 가진 9인의 재판관으로 구성하며, 재판관은
      대통령이 임명한다. 헌법개정안은 국회가 의결한 후 30일 이내에 국민투표에
      붙여 국회의원선거권자 과반수의 투표와 투표자 과반수의 찬성을 얻어야 한다.
      헌법개정은 국회재적의원 과반수 또는 대통령의 발의로 제안된다. 사법권은
      법관으로 구성된 법원에 속한다. 감사위원은 원장의 제청으로 대통령이
      임명하고, 그 임기는 4년으로 하며, 1차에 한하여 중임할 수 있다.
      체포·구속·압수 또는 수색을 할 때에는 적법한 절차에 따라 검사의 신청에
      의하여 법관이 발부한 영장을 제시하여야 한다. 다만, 현행범인인 경우와 장기
      3년 이상의 형에 해당하는 죄를 범하고 도피 또는 증거인멸의 염려가 있을
      때에는 사후에 영장을 청구할 수 있다. 국무회의는 정부의 권한에 속하는
      중요한 정책을 심의한다. 훈장등의 영전은 이를 받은 자에게만 효력이 있고,
      어떠한 특권도 이에 따르지 아니한다. 공개하지 아니한 회의내용의 공표에
      관하여는 법률이 정하는 바에 의한다. 헌법개정안이 제2항의 찬성을 얻은
      때에는 헌법개정은 확정되며, 대통령은 즉시 이를 공포하여야 한다. 국가는
      재해를 예방하고 그 위험으로부터 국민을 보호하기 위하여 노력하여야 한다.
      국가유공자·상이군경 및 전몰군경의 유가족은 법률이 정하는 바에 의하여
      우선적으로 근로의 기회를 부여받는다. 재판의 심리와 판결은 공개한다. 다만,
      심리는 국가의 안전보장 또는 안녕질서를 방해하거나 선량한 풍속을 해할
      염려가 있을 때에는 법원의 결정으로 공개하지 아니할 수 있다. 환경권의
      내용과 행사에 관하여는 법률로 정한다. 모든 국민은 인간다운 생활을 할
      권리를 가진다. 법관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는
      파면되지 아니하며, 징계처분에 의하지 아니하고는 정직·감봉 기타 불리한
      처분을 받지 아니한다. 모든 국민은 주거의 자유를 침해받지 아니한다. 주거에
      대한 압수나 수색을 할 때에는 검사의 신청에 의하여 법관이 발부한 영장을
      제시하여야 한다. 형사피의자 또는 형사피고인으로서 구금되었던 자가 법률이
      정하는 불기소처분을 받거나 무죄판결을 받은 때에는 법률이 정하는 바에
      의하여 국가에 정당한 보상을 청구할 수 있다. 모든 국민은 법률이 정하는 바에
      의하여 공무담임권을 가진다. 국회의 정기회는 법률이 정하는 바에 의하여 매년
      1회 집회되며, 국회의 임시회는 대통령 또는 국회재적의원 4분의 1 이상의
      요구에 의하여 집회된다. 대통령의 선거에 관한 사항은 법률로 정한다. 법률이
      정하는 주요방위산업체에 종사하는 근로자의 단체행동권은 법률이 정하는 바에
      의하여 이를 제한하거나 인정하지 아니할 수 있다. 국회가 재적의원 과반수의
      찬성으로 계엄의 해제를 요구한 때에는 대통령은 이를 해제하여야 한다.
      국가안전보장회의는 대통령이 주재한다. 헌법재판소 재판관은 탄핵 또는 금고
      이상의 형의 선고에 의하지 아니하고는 파면되지 아니한다.
      중앙선거관리위원회는 대통령이 임명하는 3인, 국회에서 선출하는 3인과
      대법원장이 지명하는 3인의 위원으로 구성한다. 위원장은 위원중에서 호선한다.
      헌법재판소에서 법률의 위헌결정, 탄핵의 결정, 정당해산의 결정 또는
      헌법소원에 관한 인용결정을 할 때에는 재판관 6인 이상의 찬성이 있어야 한다.
      대한민국의 주권은 국민에게 있고, 모든 권력은 국민으로부터 나온다. 대통령이
      제1항의 기간내에 공포나 재의의 요구를 하지 아니한 때에도 그 법률안은
      법률로서 확정된다. 학교교육 및 평생교육을 포함한 교육제도와 그 운영,
      교육재정 및 교원의 지위에 관한 기본적인 사항은 법률로 정한다. 국민경제의
      발전을 위한 중요정책의 수립에 관하여 대통령의 자문에 응하기 위하여
      국민경제자문회의를 둘 수 있다. 국회의원은 국가이익을 우선하여 양심에 따라
      직무를 행한다. 언론·출판은 타인의 명예나 권리 또는 공중도덕이나 사회윤리를
      침해하여서는 아니된다. 언론·출판이 타인의 명예나 권리를 침해한 때에는
      피해자는 이에 대한 피해의 배상을 청구할 수 있다. 모든 국민은 종교의 자유를
      가진다. 원장은 국회의 동의를 얻어 대통령이 임명하고, 그 임기는 4년으로
      하며, 1차에 한하여 중임할 수 있다. 국가는 모성의 보호를 위하여 노력하여야
      한다. 사면·감형 및 복권에 관한 사항은 법률로 정한다. 대통령은 필요하다고
      인정할 때에는 외교·국방·통일 기타 국가안위에 관한 중요정책을 국민투표에
      붙일 수 있다. 국가는 건전한 소비행위를 계도하고 생산품의 품질향상을
      촉구하기 위한 소비자보호운동을 법률이 정하는 바에 의하여 보장한다.
      대법원은 법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의
      내부규율과 사무처리에 관한 규칙을 제정할 수 있다. 국무총리 또는 행정각부의
      장은 소관사무에 관하여 법률이나 대통령령의 위임 또는 직권으로 총리령 또는
      부령을 발할 수 있다. 제3항의 승인을 얻지 못한 때에는 그 처분 또는 명령은
      그때부터 효력을 상실한다. 이 경우 그 명령에 의하여 개정 또는 폐지되었던
      법률은 그 명령이 승인을 얻지 못한 때부터 당연히 효력을 회복한다. 대통령은
      국회에 출석하여 발언하거나 서한으로 의견을 표시할 수 있다. 모든 국민은
      근로의 의무를 진다. 국가는 근로의 의무의 내용과 조건을 민주주의원칙에 따라
      법률로 정한다. 지방자치단체는 주민의 복리에 관한 사무를 처리하고 재산을
      관리하며, 법령의 범위안에서 자치에 관한 규정을 제정할 수 있다. 외국인은
      국제법과 조약이 정하는 바에 의하여 그 지위가 보장된다. 근로자는 근로조건의
      향상을 위하여 자주적인 단결권·단체교섭권 및 단체행동권을 가진다. 대통령은
      조약을 체결·비준하고, 외교사절을 신임·접수 또는 파견하며, 선전포고와
      강화를 한다. 모든 국민은 통신의 비밀을 침해받지 아니한다. 모든 국민은
      행위시의 법률에 의하여 범죄를 구성하지 아니하는 행위로 소추되지 아니하며,
      동일한 범죄에 대하여 거듭 처벌받지 아니한다. 국회의 회의는 공개한다. 다만,
      출석의원 과반수의 찬성이 있거나 의장이 국가의 안전보장을 위하여 필요하다고
      인정할 때에는 공개하지 아니할 수 있다. 비상계엄이 선포된 때에는 법률이
      정하는 바에 의하여 영장제도, 언론·출판·집회·결사의 자유, 정부나 법원의
      권한에 관하여 특별한 조치를 할 수 있다. 국회는 정부의 동의없이 정부가
      제출한 지출예산 각항의 금액을 증가하거나 새 비목을 설치할 수 없다. 광물
      기타 중요한 지하자원·수산자원·수력과 경제상 이용할 수 있는 자연력은 법률이
      정하는 바에 의하여 일정한 기간 그 채취·개발 또는 이용을 특허할 수 있다.
      모든 국민은 학문과 예술의 자유를 가진다. 공무원의 신분과 정치적 중립성은
      법률이 정하는 바에 의하여 보장된다. 누구든지 병역의무의 이행으로 인하여
      불이익한 처우를 받지 아니한다. 모든 국민은 건강하고 쾌적한 환경에서 생활할
      권리를 가지며, 국가와 국민은 환경보전을 위하여 노력하여야 한다. 국회는
      헌법 또는 법률에 특별한 규정이 없는 한 재적의원 과반수의 출석과 출석의원
      과반수의 찬성으로 의결한다. 가부동수인 때에는 부결된 것으로 본다. 국회는
      의원의 자격을 심사하며, 의원을 징계할 수 있다. 국무회의는
      대통령·국무총리와 15인 이상 30인 이하의 국무위원으로 구성한다. 국회는
      국민의 보통·평등·직접·비밀선거에 의하여 선출된 국회의원으로 구성한다. 모든
      국민은 보건에 관하여 국가의 보호를 받는다. 법률이 헌법에 위반되는 여부가
      재판의 전제가 된 경우에는 법원은 헌법재판소에 제청하여 그 심판에 의하여
      재판한다. 국회는 국가의 예산안을 심의·확정한다. 일반사면을 명하려면 국회의
      동의를 얻어야 한다. 대통령의 임기는 5년으로 하며, 중임할 수 없다. 재산권의
      행사는 공공복리에 적합하도록 하여야 한다. 대법원장과 대법관이 아닌 법관은
      대법관회의의 동의를 얻어 대법원장이 임명한다. 국토와 자원은 국가의 보호를
      받으며, 국가는 그 균형있는 개발과 이용을 위하여 필요한 계획을 수립한다.
      제1항의 지시를 받은 당해 행정기관은 이에 응하여야 한다.
      민주평화통일자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다.
      군인은 현역을 면한 후가 아니면 국무위원으로 임명될 수 없다. 국가는
      대외무역을 육성하며, 이를 규제·조정할 수 있다. 공공필요에 의한 재산권의
      수용·사용 또는 제한 및 그에 대한 보상은 법률로써 하되, 정당한 보상을
      지급하여야 한다. 대통령은 조국의 평화적 통일을 위한 성실한 의무를 진다.
      법률안에 이의가 있을 때에는 대통령은 제1항의 기간내에 이의서를 붙여 국회로
      환부하고, 그 재의를 요구할 수 있다. 국회의 폐회중에도 또한 같다. 모든
      국민은 인간으로서의 존엄과 가치를 가지며, 행복을 추구할 권리를 가진다.
      국가는 개인이 가지는 불가침의 기본적 인권을 확인하고 이를 보장할 의무를
      진다. 국회는 선전포고, 국군의 외국에의 파견 또는 외국군대의 대한민국
      영역안에서의 주류에 대한 동의권을 가진다. 대통령이 궐위된 때 또는 대통령
      당선자가 사망하거나 판결 기타의 사유로 그 자격을 상실한 때에는 60일 이내에
      후임자를 선거한다. 대통령은 헌법과 법률이 정하는 바에 의하여 국군을
      통수한다. 모든 국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
      대통령은 법률이 정하는 바에 의하여 훈장 기타의 영전을 수여한다. 모든
      국민은 근로의 권리를 가진다. 국가는 사회적·경제적 방법으로 근로자의 고용의
      증진과 적정임금의 보장에 노력하여야 하며, 법률이 정하는 바에 의하여
      최저임금제를 시행하여야 한다. 선거에 있어서 최고득표자가 2인 이상인 때에는
      국회의 재적의원 과반수가 출석한 공개회의에서 다수표를 얻은 자를 당선자로
      한다. 국회의원의 선거구와 비례대표제 기타 선거에 관한 사항은 법률로
      정한다. 대통령의 임기가 만료되는 때에는 임기만료 70일 내지 40일전에
      후임자를 선거한다. 대통령은 헌법과 법률이 정하는 바에 의하여 공무원을
      임면한다. 모든 국민은 고문을 받지 아니하며, 형사상 자기에게 불리한 진술을
      강요당하지 아니한다. 탄핵소추의 의결을 받은 자는 탄핵심판이 있을 때까지 그
      권한행사가 정지된다. 각급 선거관리위원회는 선거인명부의 작성등 선거사무와
      국민투표사무에 관하여 관계 행정기관에 필요한 지시를 할 수 있다. 국군은
      국가의 안전보장과 국토방위의 신성한 의무를 수행함을 사명으로 하며, 그
      정치적 중립성은 준수된다. 법원은 최고법원인 대법원과 각급법원으로
      조직된다. 대통령·국무총리·국무위원·행정각부의 장·헌법재판소
      재판관·법관·중앙선거관리위원회 위원·감사원장·감사위원 기타 법률이 정한
      공무원이 그 직무집행에 있어서 헌법이나 법률을 위배한 때에는 국회는 탄핵의
      소추를 의결할 수 있다. 이 헌법중 공무원의 임기 또는 중임제한에 관한 규정은
      이 헌법에 의하여 그 공무원이 최초로 선출 또는 임명된 때로부터 적용한다.
      모든 국민은 소급입법에 의하여 참정권의 제한을 받거나 재산권을 박탈당하지
      아니한다. 국무위원은 국정에 관하여 대통령을 보좌하며, 국무회의의
      구성원으로서 국정을 심의한다. 정부는 회계연도마다 예산안을 편성하여
      회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시 30일전까지
      이를 의결하여야 한다. 국가는 농·어민과 중소기업의 자조조직을 육성하여야
      하며, 그 자율적 활동과 발전을 보장한다. 군인은 현역을 면한 후가 아니면
      국무총리로 임명될 수 없다. 평화통일정책의 수립에 관한 대통령의 자문에
      응하기 위하여 민주평화통일자문회의를 둘 수 있다. 행정각부의 장은 국무위원
      중에서 국무총리의 제청으로 대통령이 임명한다. 헌법재판소 재판관은 정당에
      가입하거나 정치에 관여할 수 없다. 혼인과 가족생활은 개인의 존엄과 양성의
      평등을 기초로 성립되고 유지되어야 하며, 국가는 이를 보장한다.
    </Paper>
  );
}
