import { MainText, Height50, Line, Box } from './useful';

export default function Page9(props) {
  return (
    <>
      겨울 방학에 익숙해 진 것인지, 학교에 산다는 것이 너무 낯설었습니다. 3월 1일(기숙사 입소일), 5시쯤, 집에서 출발한
      나. 적어도 2주에 한 번은 오던 길, 매우 낯선길... 새로움에 설레였고, 한편으로는 두려웠습니다.
      <Height50 />
      기숙사는 5층이었습니다. 사범 선생님께서, 1학년 때 태도가 좋았던 학생들만 5층에 보내신다고 말씀하셨고, 때문에 저는
      방에 많은 기대를 가지고 있었지요. 그런데요, 저희 방이 4층보다 작더라고요. 사실 많이 실망하였지만 힘내서
      살아보겠습니다. ㅎㅎ 기숙사서 나온 후 교과서를 받으러 갔습니다. 국어 대신, 문학 과목이 주 3시간 존재하는데요, 국어
      교과서가 없다는 점이 새로웠습니다. 사용 안 할 영어 교과서, 막막한 중국어 교과서등 등 새로운 교과서를 다 받으니
      11권 정도 되었습니다. 고2가 되었다는 것이 실감났습니다.
      <Height50 />
      자습 시간에는 놀라웠습니다. 반 학생들이 모두 공부를 하더라고요. 다시 한번 놀라웠고, 고2, 3이 두려웠습니다. 저도
      분위기에 밀려 공부하였네요. 방학이 끝나가니 공부는 안하고 놀기 일수였는데요, 수학 모의고사를 풀어보니,
      어렵더라고요. 사칙 연산 실수도 많았습니다. ㅎㅎ
      <Height50 />
      자습이 끝나고, 기숙사로 올라가니 새로운 규칙이 생겼습니다. 코로나로 사라졌던, 점호가 돌아왔습니다. 작년에는
      호실장만이 아침에 나와 인원 체크 후 발열 체크로 점호를 대신하였습니다. 비단 이제는 아침, 밤에 모든 학생이 호실
      앞으로 나와 인원 확인을 받아야 하네요. 일찍 일어나는데 도움 될 것 같아 기쁘기도 합니다. 점호를 하고, 옷 갈아입고,
      잠시 쉬다가, 잘 시간이 되었습니다. 설레이는 마음으로 잠 한숨 못 잤습니다.
      <Height50 />
      2학년 2일 날, 3월 2일, 아침 6시 30분 기상 소리에 깨어났습니다. 오늘은 신입생들의 입학식 날입니다. 강당에 1학년
      모두가 앉아 있는데, 교복 자켓을 열심히 입은 모습을 보니 처음 디미고에 입학하였을 때가 생각났습니다. 당시 선서를
      외치며 제 자신이 자랑스러워지고, 고등학교 생활이 기대되었는데 신입생 모두 같은 마음이기를 바랍니다. 지필고사 때
      모든 마음이 무너지겠지만요.. 디미고 전통 중 하나는 입학식 때 입학생들이 선배들과 인사하는 것 입니다. 사실 저는
      우리 입학식 때 그일은 기억하지 못하지만, 2학년 시작전 알게된 후배 친구와 인사할 수 있어 좋았습니다. 또한 저 친구들
      중 우리 동아리에 들어올 친구가 있다고 생각하니, 나중에 크게 성공할 친구가 있다고 생각하니 디미고 애교심이 불타
      올랐습니다.
      <Height50 />
      짧지만, 저의 2학년 1, 2일 이었습니다. 인생에 중요한 시기이고, 감동 또한 있었으니 잊지 못할 것 같네요!
    </>
  );
}
